# Pandas

### Pandas is one of the tools in Machine Learning 
### It is used for data cleaning and analysis. 
### Other features : Exploring, cleaning, transforming and visualizing from data. 
### Pandas is an open-source python package built on top of Numpy

In [1]:
import pandas as pd

In [2]:
a = pd.Series([1,2,3,4,5,6])
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
type(a)

pandas.core.series.Series

In [4]:
# excessing elements form series
a[3]

4

In [5]:
a = pd.Series(['a','b','z'])
a

0    a
1    b
2    z
dtype: object

In [6]:
# Date index
date = pd.date_range(start='14-06-2000', end='25-06-2000')
date

DatetimeIndex(['2000-06-14', '2000-06-15', '2000-06-16', '2000-06-17',
               '2000-06-18', '2000-06-19', '2000-06-20', '2000-06-21',
               '2000-06-22', '2000-06-23', '2000-06-24', '2000-06-25'],
              dtype='datetime64[ns]', freq='D')

In [7]:
type(date)

pandas.core.indexes.datetimes.DatetimeIndex

## Pandas Dataframe

In [8]:
# creating array of data
name = ['Deepanshu','Gunjan','Vikrant','Amrita','Neha']

In [9]:
domain = ['AI/ML','Java','JS','Python','AI/ML']

In [10]:
experience = [3,2,4,1,3]

In [11]:
# creating dictonary from array
data = {'Name': name,
        'Domain':domain,
        'Experience':experience
}

In [12]:
# passing dictionary to DataFrame
df = pd.DataFrame(data)
df

        Name  Domain  Experience
0  Deepanshu   AI/ML           3
1     Gunjan    Java           2
2    Vikrant      JS           4
3     Amrita  Python           1
4       Neha   AI/ML           3

In [13]:
# zip function: take out values of particular index and make a tuple out of it

zipped = list(zip(name,domain,experience))
zipped

[('Deepanshu', 'AI/ML', 3),
 ('Gunjan', 'Java', 2),
 ('Vikrant', 'JS', 4),
 ('Amrita', 'Python', 1),
 ('Neha', 'AI/ML', 3)]

In [14]:
import numpy as np

In [15]:
# pick random numbers in between low and high and shape is given in size
val1 = np.random.randint(low =10,high=90,size=[20,])
val1

array([81, 67, 40, 16, 64, 15, 19, 21, 52, 86, 27, 33, 43, 86, 19, 10, 47,
       10, 10, 26])

In [16]:
# pick passed elements from the given list
val2 = np.random.choice(['Ansh','vans','veer','shiv'],20)
val2

array(['Ansh', 'Ansh', 'veer', 'Ansh', 'veer', 'vans', 'Ansh', 'veer',
       'vans', 'shiv', 'shiv', 'vans', 'vans', 'shiv', 'Ansh', 'shiv',
       'shiv', 'Ansh', 'vans', 'veer'], dtype='<U4')

In [17]:
zipped = list(zip(val1,val2))
zipped

[(81, 'Ansh'),
 (67, 'Ansh'),
 (40, 'veer'),
 (16, 'Ansh'),
 (64, 'veer'),
 (15, 'vans'),
 (19, 'Ansh'),
 (21, 'veer'),
 (52, 'vans'),
 (86, 'shiv'),
 (27, 'shiv'),
 (33, 'vans'),
 (43, 'vans'),
 (86, 'shiv'),
 (19, 'Ansh'),
 (10, 'shiv'),
 (47, 'shiv'),
 (10, 'Ansh'),
 (10, 'vans'),
 (26, 'veer')]

In [18]:
# creating dataframe
df = pd.DataFrame(data=zipped,columns=['Age','Name'])
df

    Age  Name
0    81  Ansh
1    67  Ansh
2    40  veer
3    16  Ansh
4    64  veer
5    15  vans
6    19  Ansh
7    21  veer
8    52  vans
9    86  shiv
10   27  shiv
11   33  vans
12   43  vans
13   86  shiv
14   19  Ansh
15   10  shiv
16   47  shiv
17   10  Ansh
18   10  vans
19   26  veer

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
#Default 5 top values
df.head()

   Age  Name
0   81  Ansh
1   67  Ansh
2   40  veer
3   16  Ansh
4   64  veer

In [21]:
df.head(2)

   Age  Name
0   81  Ansh
1   67  Ansh

In [22]:
#tail return last rows
df.tail()

    Age  Name
15   10  shiv
16   47  shiv
17   10  Ansh
18   10  vans
19   26  veer

In [23]:
df.tail(3)

    Age  Name
17   10  Ansh
18   10  vans
19   26  veer

In [24]:
#return shape
df.shape

(20, 2)

In [25]:
# return columns name and type (string is for objects)
df.columns

Index(['Age', 'Name'], dtype='object')

### Accessing DataFrame